주피터 SQL 엔진 설정

In [ ]:
%load_ext sql

In [ ]:
# ID와 PW를 자신의 환경에 맞게 수정
%sql postgresql://guest:Guest1!*@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

'Connected: guest@dev'

In [ ]:
#월별 총 세션 수 
%%sql
SELECT DATEPART(Month,Date(ts)) monthly, count(DATEPART(Month,Date(ts)))
FROM raw_data.session_timestamp
Group by 1
Order by 1

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[(5, 6261),
 (6, 10520),
 (7, 14840),
 (8, 17151),
 (9, 15790),
 (10, 18899),
 (11, 18059)]

In [ ]:
#월별 총 세션 수 시도2
%%sql
SELECT to_char(ts, 'YYYY-MM') as month, count(sessionid)
FROM raw_data.session_timestamp
Group by 1
Order by 1

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-05', 6261),
 ('2019-06', 10520),
 ('2019-07', 14840),
 ('2019-08', 17151),
 ('2019-09', 15790),
 ('2019-10', 18899),
 ('2019-11', 18059)]

In [ ]:
#월별 총 세션 수 시도3
%%sql
SELECT to_char(ts, 'YYYY-MM') as month, count(distinct sessionid), count(sessionid), count(1)
FROM raw_data.session_timestamp
Group by 1
Order by 1

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-05', 6261, 6261, 6261),
 ('2019-06', 10520, 10520, 10520),
 ('2019-07', 14840, 14840, 14840),
 ('2019-08', 17151, 17151, 17151),
 ('2019-09', 15790, 15790, 15790),
 ('2019-10', 18899, 18899, 18899),
 ('2019-11', 18059, 18059, 18059)]

In [ ]:
#월별 유니크한 사용자 수 (MAU - Monthly Active User)
%%sql
SELECT DATEPART(Month,Date(ts)) as month, COUNT(DISTINCT usc.userID), count(userID) as userID, count(usc.sessionid) as sessionid
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1
LIMIT 10;

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[(5, 281, 6261, 6261),
 (6, 459, 10520, 10520),
 (7, 623, 14840, 14840),
 (8, 662, 17151, 17151),
 (9, 639, 15790, 15790),
 (10, 763, 18899, 18899),
 (11, 721, 18059, 18059)]

In [ ]:
#월별 채널별 유니크한 사용자 수 
%%sql
SELECT DATEPART(Month,Date(ts)) as month, channel, COUNT(DISTINCT usc.userID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1, 2 -- month, channel
ORDER BY 1

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
42 rows affected.

[(5, 'Google', 253),
 (5, 'Youtube', 244),
 (5, 'Facebook', 247),
 (5, 'Organic', 238),
 (5, 'Naver', 237),
 (5, 'Instagram', 234),
 (6, 'Youtube', 400),
 (6, 'Google', 412),
 (6, 'Facebook', 414),
 (6, 'Naver', 398),
 (6, 'Instagram', 410),
 (6, 'Organic', 416),
 (7, 'Naver', 553),
 (7, 'Facebook', 558),
 (7, 'Instagram', 567),
 (7, 'Organic', 557),
 (7, 'Youtube', 564),
 (7, 'Google', 556),
 (8, 'Organic', 608),
 (8, 'Instagram', 621),
 (8, 'Google', 610),
 (8, 'Naver', 626),
 (8, 'Facebook', 611),
 (8, 'Youtube', 614),
 (9, 'Facebook', 597),
 (9, 'Google', 599),
 (9, 'Organic', 592),
 (9, 'Instagram', 588),
 (9, 'Youtube', 588),
 (9, 'Naver', 592),
 (10, 'Youtube', 705),
 (10, 'Google', 699),
 (10, 'Facebook', 698),
 (10, 'Organic', 709),
 (10, 'Naver', 713),
 (10, 'Instagram', 707),
 (11, 'Naver', 667),
 (11, 'Youtube', 677),
 (11, 'Instagram', 669),
 (11, 'Google', 688),
 (11, 'Facebook', 688),
 (11, 'Organic', 677)]

In [ ]:
#가장 많이 사용된 채널, 
#인터뷰시 묻는다면 '가장많이' 사용되었다는 정의가 무엇인지 물어봐야한다, 사용자기준? 세션기준? 여유있게 질문하는 센스 필요
%%sql
SELECT usc.channel, count(*), count(1), count(sessionid)
FROM raw_data.user_session_channel usc 
Group by 1
Order by 2 DESC
Limit 1

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[('Youtube', 17091, 17091, 17091)]

In [ ]:
#가장 많은 세션을 만들어낸 사용자 ID
%%sql
SELECT DISTINCT userID, count(*), count(1), count(distinct sessionid)
FROM raw_data.user_session_channel 
Group by 1
Order by 2 DESC
Limit 10

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(1615, 528, 528, 528),
 (989, 429, 429, 429),
 (1493, 396, 396, 396),
 (1651, 385, 385, 385),
 (80, 382, 382, 382),
 (1047, 346, 346, 346),
 (511, 305, 305, 305),
 (369, 295, 295, 295),
 (676, 293, 293, 293),
 (757, 291, 291, 291)]

In [ ]:
#동점이 있는경우
%%sql
SELECT userid, COUNT(sessionid)
FROM raw_data.user_session_channel
GROUP BY 1
HAVING COUNT(sessionid) = (
    SELECT MAX(session_count)
    FROM (
        SELECT userid, COUNT(sessionid) AS session_count
        FROM raw_data.user_session_channel
        GROUP BY userid
    )
);

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(1615, 528)]

다양한 SELECT 실행해보기

In [ ]:
%%sql

SELECT *
FROM raw_data.session_timestamp
LIMIT 10

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[('7cdace91c487558e27ce54df7cdb299c', datetime.datetime(2019, 5, 1, 0, 13, 11, 783000)),
 ('7ed2d3454c5eea71148b11d0c25104ff', datetime.datetime(2019, 5, 1, 10, 18, 43, 210000)),
 ('fd0efcca272f704a760c3b61dcc70fd0', datetime.datetime(2019, 5, 1, 13, 45, 19, 793000)),
 ('c5f441cd5f43eb2f2c024e1f8b5d00cd', datetime.datetime(2019, 5, 1, 15, 3, 54, 650000)),
 ('3d191ef6e236bd1b9bdb9ff4743c47fe', datetime.datetime(2019, 5, 1, 15, 33, 58, 197000)),
 ('cd0b43eac0392accf3624b7372dec36e', datetime.datetime(2019, 5, 1, 16, 33, 3, 463000)),
 ('c67ba7c4c5c0cd4cc3e3a7146fe5c015', datetime.datetime(2019, 5, 1, 17, 42, 13, 580000)),
 ('63dfdeb1ff9ff09ecc3f05d2d7221ffa', datetime.datetime(2019, 5, 1, 18, 35, 48, 620000)),
 ('8d3215ae97598264ad6529613774a038', datetime.datetime(2019, 5, 1, 21, 21, 12, 953000)),
 ('4c4c937b67cc8d785cea1e42ccea185c', datetime.datetime(2019, 5, 1, 23, 50, 38))]

In [ ]:
%%sql

SELECT*
FROM raw_data.user_session_channel

LIMIT 10;

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(80, 'fdc0eb412a84fa549afe68373d9087e9', 'Organic'),
 (264, 'a914ecef9c12ffdb9bede64bb703d877', 'Google'),
 (229, 'eddeb82df22554fa67c641e3f8a25566', 'Google'),
 (80, '8ae1da0fe37c98412768453f82490da2', 'Organic'),
 (198, '90f4760fcc9b69c13da7368c5c2917f3', 'Facebook'),
 (237, '233f1dd0f3f537bcb7a338ea74d63483', 'Organic'),
 (341, 'e10534dd65cf727692c0f9c44ba613f8', 'Naver'),
 (757, '675f9820626f5bc0afb47b57890b466e', 'Google'),
 (786, '569ff987c643b4bedf504efda8f786c2', 'Youtube'),
 (661, '567b8f5f423af15818a068235807edc0', 'Naver')]

In [ ]:
%%sql

SELECT DATE(ts) date, sessionID
FROM raw_data.session_timestamp
ORDER BY ts desc
LIMIT 10;

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 11, 30), '6309ff4befccf8ba77b16141fab763c6'),
 (datetime.date(2019, 11, 30), '42daed3b750cc5c6270636fddee0486d'),
 (datetime.date(2019, 11, 30), '398c674511e98d3e9bd40ba5bfa67af8'),
 (datetime.date(2019, 11, 30), '1e65c9f788d6382abc0ee60886e7fa4a'),
 (datetime.date(2019, 11, 30), 'ec6d363a01a8a0691d24b8556bc1fb61'),
 (datetime.date(2019, 11, 30), '8f48bd8292fc4540404dc9dae06175e6'),
 (datetime.date(2019, 11, 30), '89a76004709bb668a8aefb6306a6aed1'),
 (datetime.date(2019, 11, 30), '9cfaefd1e81f637fad6330ff16eb1f39'),
 (datetime.date(2019, 11, 30), 'bbf2f1c020c5e39734c73223784bd7b4'),
 (datetime.date(2019, 11, 30), 'bac82af401b714e895c9c46af11f76ea')]

In [ ]:
%%sql

SELECT DATE(ts) date, COUNT(sessionID)
FROM raw_data.session_timestamp
GROUP BY 1
LIMIT 10;

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 5, 1), 147),
 (datetime.date(2019, 5, 2), 161),
 (datetime.date(2019, 5, 3), 150),
 (datetime.date(2019, 5, 4), 142),
 (datetime.date(2019, 5, 6), 164),
 (datetime.date(2019, 5, 7), 180),
 (datetime.date(2019, 5, 8), 161),
 (datetime.date(2019, 5, 10), 176),
 (datetime.date(2019, 5, 12), 171),
 (datetime.date(2019, 5, 13), 178)]

In [ ]:
%%sql

SELECT DATE(ts) date, COUNT(sessionID)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 10, 23), 678),
 (datetime.date(2019, 11, 13), 671),
 (datetime.date(2019, 11, 12), 668),
 (datetime.date(2019, 10, 11), 665),
 (datetime.date(2019, 10, 29), 660),
 (datetime.date(2019, 10, 21), 653),
 (datetime.date(2019, 11, 5), 652),
 (datetime.date(2019, 11, 11), 651),
 (datetime.date(2019, 10, 14), 648),
 (datetime.date(2019, 11, 7), 645)]

In [ ]:
%%sql

SELECT DATE(ts) date, COUNT(sessionID)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 1
LIMIT 10; -- DESC

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 5, 1), 147),
 (datetime.date(2019, 5, 2), 161),
 (datetime.date(2019, 5, 3), 150),
 (datetime.date(2019, 5, 4), 142),
 (datetime.date(2019, 5, 5), 144),
 (datetime.date(2019, 5, 6), 164),
 (datetime.date(2019, 5, 7), 180),
 (datetime.date(2019, 5, 8), 161),
 (datetime.date(2019, 5, 9), 169),
 (datetime.date(2019, 5, 10), 176)]

JOIN에 대해 배워보자. 일별 방문 유니크한 사용자의 수를 계산하고 싶다면?

In [ ]:
# raw_data.user_session_channel과 raw_data.session_timestamp 테이블의 조인이 필요
%%sql

SELECT DATE(st.ts) date, COUNT(usc.userID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1
LIMIT 10;

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 5, 1), 147),
 (datetime.date(2019, 5, 2), 161),
 (datetime.date(2019, 5, 3), 150),
 (datetime.date(2019, 5, 4), 142),
 (datetime.date(2019, 5, 5), 144),
 (datetime.date(2019, 5, 6), 164),
 (datetime.date(2019, 5, 7), 180),
 (datetime.date(2019, 5, 8), 161),
 (datetime.date(2019, 5, 9), 169),
 (datetime.date(2019, 5, 10), 176)]

In [ ]:
# raw_data.user_session_channel과 raw_data.session_timestamp 테이블의 조인이 필요
%%sql

SELECT DATE(st.ts) date, COUNT(DISTINCT usc.userID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1
LIMIT 10;

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 5, 1), 119),
 (datetime.date(2019, 5, 2), 127),
 (datetime.date(2019, 5, 3), 130),
 (datetime.date(2019, 5, 4), 122),
 (datetime.date(2019, 5, 5), 124),
 (datetime.date(2019, 5, 6), 133),
 (datetime.date(2019, 5, 7), 147),
 (datetime.date(2019, 5, 8), 135),
 (datetime.date(2019, 5, 9), 145),
 (datetime.date(2019, 5, 10), 144)]

In [ ]:
%%sql

SELECT channel, count(st.sessionID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1 
ORDER BY 1

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
6 rows affected.

[('Facebook', 16791),
 ('Google', 16982),
 ('Instagram', 16831),
 ('Naver', 16921),
 ('Organic', 16904),
 ('Youtube', 17091)]

In [ ]:
%%sql

SELECT COUNT(1)
FROM raw_data.user_session_channel 
WHERE channel ilike '%o%'

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(67768,)]

In [ ]:
%%sql
SELECT COUNT(0)

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(1,)]

판다스와 연동하는 방법

In [ ]:
result = %sql SELECT * FROM raw_data.user_session_channel
df = result.DataFrame()

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
101520 rows affected.

In [ ]:
df.head()

   userid                         sessionid   channel
0      80  fdc0eb412a84fa549afe68373d9087e9   Organic
1     264  a914ecef9c12ffdb9bede64bb703d877    Google
2     229  eddeb82df22554fa67c641e3f8a25566    Google
3      80  8ae1da0fe37c98412768453f82490da2   Organic
4     198  90f4760fcc9b69c13da7368c5c2917f3  Facebook

In [ ]:
df.groupby(["channel"]).size()

channel
Facebook     16791
Google       16982
Instagram    16831
Naver        16921
Organic      16904
Youtube      17091
dtype: int64

In [ ]:
df.groupby(["channel"])["sessionid"].count()

channel
Facebook     16791
Google       16982
Instagram    16831
Naver        16921
Organic      16904
Youtube      17091
Name: sessionid, dtype: int64

In [ ]:
result = %sql SELECT * FROM raw_data.session_timestamp
df_st = result.DataFrame()

 * postgresql://guest:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
101520 rows affected.

In [ ]:
df_st['date'] = df_st['ts'].apply(lambda x: "%d-%02d-%02d" % (x.year, x.month, x.day))

In [ ]:
df_st.head()

                          sessionid                      ts        date
0  94f192dee566b018e0acf31e1f99a2d9 2019-05-01 00:49:46.073  2019-05-01
1  f1daf122cde863010844459363cd31db 2019-05-01 13:10:56.413  2019-05-01
2  8804f94e16ba5b680e239a554a08f7d2 2019-05-01 14:23:07.660  2019-05-01
3  d5fcc35c94879a4afad61cacca56192c 2019-05-01 15:13:16.140  2019-05-01
4  c17028c9b6e0c5deaad29665d582284a 2019-05-01 15:59:57.490  2019-05-01

In [ ]:
df_st.groupby(["date"]).size()  # .sort_values(["date"])

date
2019-05-01    147
2019-05-02    161
2019-05-03    150
2019-05-04    142
2019-05-05    144
             ...
2019-11-26    633
2019-11-27    617
2019-11-28    516
2019-11-29    531
2019-11-30    562
Length: 214, dtype: int64

In [ ]:
df_st.groupby(["date"])["sessionid"].count().reset_index(name='count').sort_values("date", ascending=False)

           date  count
213  2019-11-30    562
212  2019-11-29    531
211  2019-11-28    516
210  2019-11-27    617
209  2019-11-26    633
..          ...    ...
4    2019-05-05    144
3    2019-05-04    142
2    2019-05-03    150
1    2019-05-02    161
0    2019-05-01    147

[214 rows x 2 columns]